app/Http/Controllers/DashController.php

    public function index()
    {
        if (auth()->user()->hasAnyRole(["admin", "worker"])) {
            $prices = orderDone::all();
            $total = 0;
            foreach ($prices as $price) {
                $total += $price->harga;
            }

            Logging::create([
                "userid" => auth()->user()->id,
                "username" => auth()->user()->username,
                "role" => auth()->user()->getRoleNames(),
                "activity" => "Melihat dashboard"
            ]);
            return view("admin.index", [
                "title" => "Welcome to Dashboard",
                "totalEarn" => $total,
                "ongoOrders" => ongoing::count(),
                "pendingOrders" => Order::count(),
                "orderDones" => orderDone::count()
            ]);
---
INSERT INTO `loggings` (`userid`, `username`, `role`, `activity`, `updated_at`, `created_at`) VALUES (1, 'intan.laksita', ["worker"], 'Melihat dashboard', '2024-04-14 23:16:30', '2024-04-14 23:16:30')
SELECT * FROM `order_dones`
SELECT count(*) as aggregate FROM `orders`
SELECT count(*) as aggregate FROM `order_dones`

    public function showUser()
    {
        return view("admin.user", [
            "title" => "User Dashboard",
            "users" => User::all()
---
SELECT * FROM `users`

    public function showCust()
    {
        return view('admin.customer', [
            "title" => "Our customer",
            "customer" => Order::all()
---
SELECT * FROM `orders`

    public function showComplete()
    {
        $userid = Auth::user()->id;
        return view("admin.order_done", [
            "title" => "Order Completed",
            "orderan" => orderDone::where("user_id", "=", $userid)->get()
        ]);
---
SELECT * FROM `order_dones` WHERE `user_id` = 6