app/Http/Controllers/DetailController.php

SELECT * FROM `jasas` WHERE `jasas`.`product_id` = 2 and `jasas`.`product_id` IS not NULL
SELECT * FROM `riviews` WHERE `riviews`.`product_id` = 2 and `riviews`.`product_id` IS not NULL
SELECT * FROM `joki_rules` WHERE `joki_rules`.`product_id` = 2 and `joki_rules`.`product_id` IS not NULL
SELECT * FROM `payments`
---
    public function show(Request $request, Product $product){
        $reqHero = false;
        if($product->name == "Joki Rank S-13" || $product->name == "Joki Competitive"){
            $reqHero = true;
        }

        $jasa = $product->jasa;
        $riviews = $product->riview;
        $rules = $product->rules;
        return view('detail.index',[
            'title' => $product->name,
            'product' => $product,
            'jasas' => $jasa,
            'rules' => $rules,
            'payments' => payment::all(),
            'reqHero' => $reqHero,
            'riviews' => $riviews
        ]);