app/Http/Controllers/homeController.php

SELECT * FROM `games` WHERE `games`.`id` in (1, 2, 3, 4, 5, 6, 7)
SELECT * FROM `products`
SELECT * FROM `chats`
---
    public function index(){
        return view('home.home',[
            'title' => 'Joki Arceus :)',
            'category' => Product::with('game')->get(),
            'product' => Product::all()->find(1),
            'AllProduct' => Product::all(),
            'chat'  => chat::all()

SELECT * FROM `orders` ORDER BY `created_at` DESC LIMIT 10 offset 0
SELECT count(*) as aggregate FROM `orders`
---
    public function riwayat(){
        return view('home.riwayat',[
            "title" => "Riwayat Pembelian",
            "riwayat" => Order::latest()->paginate(10),

SELECT * FROM `products`
SELECT * FROM `chats`
---
    public function show(Product $product){
        return view('home.home',[
            'title' => $product->name,
            'category' => Product::all(),
            'product' => $product,
            'chat'  => chat::all()