app/Http/Controllers/LoginController.php

    public function authData(Request $req):RedirectResponse{
        $remember = $req->remember;
        $credentials = $req->validate([
            'username' => 'required',
            'password' => 'required',
        ]);

        if(Auth::attempt($credentials,$remember)){
            $req->session()->regenerate();
            $id = Auth::user()->id;
            $user = User::find($id);

            if(!$user->hasAnyRole(["user","worker","admin"])){
                $user->syncRoles(['user']);
            }

            Logging::create([
                "userid" => $id,
                "username" => auth()->user()->username,
                "role" => auth()->user()->getRoleNames(),
                "activity" => "Melakukan Login",
            ]);
---
SELECT * FROM `users` WHERE `users`.`id` = 1 LIMIT 1
INSERT INTO `loggings` (`userid`, `username`, `role`, `activity`, `updated_at`, `created_at`) VALUES (1, 'intan.laksita', ["worker"], 'Melakukan Login', '2024-04-14 22:47:08', '2024-04-14 22:47:08')

    public function logout(Request $req){
        Logging::create([
            "userid" => auth()->user()->id,
            "username" => auth()->user()->username,
            "role" => auth()->user()->getRoleNames(),
            "activity" => "Melakukan Logout",
        ]);
---
INSERT INTO `loggings` (`userid`, `username`, `role`, `activity`, `updated_at`, `created_at`) VALUES (6, 'kepo', ["admin"], 'Melakukan Logout', '2024-04-14 22:46:58', '2024-04-14 22:46:58')