app/Http/Controllers/UserDashController.php

    public function index()
    {
        $id = auth()->user()->id;
        $user = User::find($id);
        $ortal = orderDone::where('customer_id', $id);

        return view('user.account', [
            'title' => "User Dashboard",
            'user' => $user,
            'ortal' => $ortal->count(),
            'riviews' => RiviewAuth::where('user_id', '=', $id)->get()
---
SELECT * FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT * FROM `riview_auths` WHERE `user_id` = 1

    public function update_account(Request $request)
    {
        $user = User::find($request->id);

        if (!$user) {
            return redirect()->back()->with('error', 'User not found');
        }

        $rules = [
            'fullname' => ['required'],
            'profil' => ['image','mimes:jpg,jpeg,png,gif,svg,webp,avif','max:1048']
        ];

        // Check if the username has changed or is being used by someone else
        if ($request->username !== $user->username || User::where('username', $request->username)->where('id', '!=', $user->id)->exists()) {
            $rules['username'] = ['required', 'unique:users'];
        } else {
            $rules['username'] = ['required'];
        }

        // Check if the email has changed or is being used by someone else
        if ($request->email !== $user->email || User::where('email', $request->email)->where('id', '!=', $user->id)->exists()) {
            $rules['email'] = ['required', 'email', 'unique:users', 'email:dns'];
        } else {
            $rules['email'] = ['required', 'email', 'email:dns'];
        }

        // Check if the noTelpon has changed or is being used by someone else
        if ($request->noTelpon !== $user->noTelpon || User::where('noTelpon', $request->noTelpon)->where('id', '!=', $user->id)->exists()) {
---
SELECT * FROM `users` WHERE `users`.`id` = '1' LIMIT 1
SELECT exists(SELECT * FROM `users` WHERE `username` = 'intan.laksita' and `id` != 1) as `exists`
SELECT exists(SELECT * FROM `users` WHERE `email` = 'eeeeee@gmail.com' and `id` != 6) as `exists`
SELECT exists(SELECT * FROM `users` WHERE `noTelpon` = '(+62) 872 2608 900' and `id` != 1) as `exists`